test/example.laminarVortexShedding/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       icoFoam;

startFrom         latestTime;

startTime         0;

stopAt            endTime;

endTime           170;

deltaT            0.005;

writeControl      adjustableRunTime;

writeInterval     20;

purgeWrite        1;

writeFormat       compressed;

writePrecision    12;

writeCompression  off;

timeFormat        general;

timePrecision     12;

runTimeModifiable yes;

adjustTimeStep    yes;

maxCo             0.3;

maxDeltaT         20.0;

// ************************************************************************* //

// ************************************************************************* //
functions
{
  
forces
{
    type                forces;
    functionObjectLibs  ("libforces.so");
    outputControl       timeStep;
    outputInterval      $writeInterval;
     
    patches             ( "cylinderWalls" );
    pName               p;
    UName               U;
    rhoName             rhoInf;
    log                 true; 
    CofR                (0 0 0);     
    rhoInf              1.00;
}
 
 
forceCoeffs
{
    type                forceCoeffs;
    functionObjectLibs  ( "libforces.so" );
    outputControl       timeStep;
    outputInterval      $writeInterval;
 
    patches             ( "cylinderWalls" );
    pName               p;
    UName               U;
    rhoName             rhoInf;
    log                 true;
    rhoInf              1.00;
     
    liftDir             (0 1 0);
    dragDir             (1 0 0);
    CofR                (0 0 0);
    pitchAxis           (0 0 1);
     
    magUInf             1;
    rhoInf              1.00;
    lRef                1;
    Aref                1;
}

#include "sampling/internalCloud"

}
